# IncludeShadingSurfaces Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisDetailModel..::..IncludeShadingSurfaces Property
EnergyAnalysisDetailModel Class See Also
---
Indicates if to set and get the setting for if shading surfaces should be included.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IncludeShadingSurfaces { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IncludeShadingSurfaces As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IncludeShadingSurfaces {
	bool get ();
}
```

# See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace